Tester/src/InformationRegisters/Jobs/Jobs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Jobs</name>
  <resources>
    <name>Agent</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <resources>
    <name>Computer</name>
    <type>
      <types>CatalogRef.Computers</types>
    </type>
  </resources>
  <resources>
    <name>Created</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Job</name>
    <type>
      <types>DocumentRef.Job</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester/src/InformationRegisters/AgentJobs/AgentJobs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AgentJobs</name>
  <resources>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Finish</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Finished</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Session</name>
    <type>
      <types>CatalogRef.Sessions</types>
    </type>
  </resources>
  <resources>
    <name>Start</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Started</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.JobStatuses</types>
    </type>
  </resources>
  <dimensions>
    <name>Job</name>
    <type>
      <types>DocumentRef.Job</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester/src/InformationRegisters/AgentStatuses/AgentStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AgentStatuses</name>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.AgentStatuses</types>
    </type>
  </resources>
  <dimensions>
    <name>Session</name>
    <type>
      <types>CatalogRef.Sessions</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester/src/InformationRegisters/AgentScenarios/AgentScenarios.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AgentScenarios</name>
  <resources>
    <name>Finished</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Started</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Job</name>
    <type>
      <types>DocumentRef.Job</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Row</name>
    <type>
      <types>DefinedType.LineNumber</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester/src/Enums/AgentStatuses/AgentStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AgentStatuses</name>
  <enumValues>
    <name>Available</name>
  </enumValues>
  <enumValues>
    <name>Busy</name>
  </enumValues>
  <enumValues>
    <name>Offline</name>
  </enumValues>
</mdclass:Enum>

Tester/src/Enums/JobStatuses/JobStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>JobStatuses</name>
  <enumValues>
    <name>Fault</name>
  </enumValues>
  <enumValues>
    <name>Passed</name>
  </enumValues>
  <enumValues>
    <name>Pending</name>
  </enumValues>
  <enumValues>
    <name>Removed</name>
  </enumValues>
  <enumValues>
    <name>Running</name>
  </enumValues>
</mdclass:Enum>

Tester/src/Enums/Running/Running.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Running</name>
  <enumValues>
    <name>Now</name>
  </enumValues>
  <enumValues>
    <name>Schedule</name>
  </enumValues>
</mdclass:Enum>

Tester/src/Documents/Job/Job.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Job</name>
  <posting>Deny</posting>
  <attributes>
    <name>Agent</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Computer</name>
    <type>
      <types>CatalogRef.Computers</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>IgnoreCompletion</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Job</name>
    <type>
      <types>DocumentRef.Job</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Mode</name>
    <type>
      <types>EnumRef.Running</types>
    </type>
  </attributes>
  <attributes>
    <name>Parameters</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Scenario</name>
    <type>
      <types>CatalogRef.Scenarios</types>
    </type>
  </attributes>
  <attributes>
    <name>Schedule</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Scenarios</name>
    <attributes>
      <name>Application</name>
      <type>
        <types>CatalogRef.Applications</types>
      </type>
    </attributes>
    <attributes>
      <name>Scenario</name>
      <type>
        <types>CatalogRef.Scenarios</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Tester/src/Catalogs/ErrorLog/ErrorLog.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ErrorLog</name>
  <attributes>
    <name>Application</name>
    <type>
      <types>CatalogRef.Applications</types>
    </type>
  </attributes>
  <attributes>
    <name>ApplicationError</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Area</name>
    <type>
      <types>CatalogRef.Areas</types>
    </type>
  </attributes>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>FullText</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Job</name>
    <type>
      <types>DocumentRef.Job</types>
    </type>
  </attributes>
  <attributes>
    <name>Line</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ParentJob</name>
    <type>
      <types>DocumentRef.Job</types>
    </type>
  </attributes>
  <attributes>
    <name>Row</name>
    <type>
      <types>DefinedType.LineNumber</types>
    </type>
  </attributes>
  <attributes>
    <name>Scenario</name>
    <type>
      <types>CatalogRef.Versions</types>
      <types>CatalogRef.Scenarios</types>
    </type>
  </attributes>
  <attributes>
    <name>Screenshot</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ScreenshotExists</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Session</name>
    <type>
      <types>CatalogRef.Sessions</types>
    </type>
  </attributes>
  <attributes>
    <name>Source</name>
    <type>
      <types>CatalogRef.Scenarios</types>
    </type>
  </attributes>
  <attributes>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ApplicationStack</name>
    <attributes>
      <name>Row</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Module</name>
    <attributes>
      <name>Calling</name>
      <type>
        <types>CatalogRef.Versions</types>
        <types>CatalogRef.Scenarios</types>
      </type>
    </attributes>
    <attributes>
      <name>Level</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Line</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Row</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Scenario</name>
      <type>
        <types>CatalogRef.Versions</types>
        <types>CatalogRef.Scenarios</types>
      </type>
    </attributes>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.Module</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Stack</name>
    <attributes>
      <name>Area</name>
      <type>
        <types>CatalogRef.Areas</types>
      </type>
    </attributes>
    <attributes>
      <name>Row</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Scenario</name>
      <type>
        <types>CatalogRef.Versions</types>
        <types>CatalogRef.Scenarios</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccessDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Agent</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApplicationsAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TimeZone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Applications</name>
    <attributes>
      <name>Application</name>
      <type>
        <types>CatalogRef.Applications</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Managers</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/CommonModules/TesterAgent/Module.bsl
Function GetWork () export
	
	if ( Jobs.GetBackground ( "Exchange" ) <> undefined ) then
		return undefined;
	endif;
	job = findJob ();
	if ( job = undefined ) then
		return undefined;
	else
		return new Structure ( "Job, Parameters, Scenarios", job.Job, job.Parameters, getScenarios ( job ) );
	endif;
	
EndFunction

Function findJob ()
	
	s = "
	|select top 1 Jobs.Job as Job, Jobs.Job.Parameters as Parameters
	|from InformationRegister.Jobs as Jobs
	|where Jobs.Agent = &Agent
	|and Jobs.Computer in ( value ( Catalog.Computers.EmptyRef ), &Computer )
	|order by Jobs.Created
	|";
	q = new Query ( s );
	q.SetParameter ( "Agent", SessionParameters.User );
	q.SetParameter ( "Computer", SessionData.Computer () );
	table = q.Execute ().Unload ();
	return ? ( table.Count () = 0, undefined, table [ 0 ] );
	
EndFunction

Function getScenarios ( Job )
	
	s = "
	|select Scenarios.Scenario as Scenario, Scenarios.Application as Application,
	|	Scenarios.LineNumber as LineNumber
	|from Document.Job.Scenarios as Scenarios
	|where Scenarios.Ref = &Job
	|order by Scenarios.LineNumber
	|";
	q = new Query ( s );
	q.SetParameter ( "Job", Job.Job );
	return Collections.Serialize ( q.Execute ().Unload () );
	
EndFunction

Procedure Start ( val Job ) export
	
	TesterAgent.AgentStatus ( Enums.AgentStatuses.Busy );
	SetPrivilegedMode ( true );
	r = InformationRegisters.Jobs.CreateRecordManager ();
	r.Job = Job;
	r.Delete ();
	r = InformationRegisters.AgentJobs.CreateRecordManager ();
	r.Job = Job;
	r.Started = CurrentSessionDate ();
	r.Start = CurrentUniversalDateInMilliseconds ();
	r.Session = SessionParameters.Session;
	r.Status = Enums.JobStatuses.Running;
	r.Write ();
	
EndProcedure

Procedure AgentStatus ( val Status ) export
	
	SetPrivilegedMode ( true );
	r = InformationRegisters.AgentStatuses.CreateRecordManager ();
	session = SessionParameters.Session;
	r.Session = session;
	r.Read ();
	if ( r.Status = Status ) then
		return;
	endif;
	r.Session = session;
	r.Status = Status;
	ExchangeKillers.Write ( r );
	
EndProcedure

Procedure Finish ( val Job ) export
	
	SetPrivilegedMode ( true );
	r = InformationRegisters.AgentJobs.CreateRecordManager ();
	r.Job = Job;
	r.Read ();
	r.Finished = CurrentSessionDate ();
	finish = CurrentUniversalDateInMilliseconds ();
	r.Finish = finish;
	r.Duration = finish - r.Start;
	r.Status = ? ( hasErrors ( Job ), Enums.JobStatuses.Fault, Enums.JobStatuses.Passed );
	r.Write ();
	TesterAgent.AgentStatus ( Enums.AgentStatuses.Available );
	
EndProcedure

Function hasErrors ( Job )
	
	s = "
	|select top 1 1
	|from Catalog.ErrorLog as Log
	|where Log.Job = &Ref
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Job );
	return not q.Execute ().IsEmpty ();
	
EndFunction

Procedure StartScenario ( val Job, val Row ) export
	
	SetPrivilegedMode ( true );
	r = InformationRegisters.AgentScenarios.CreateRecordManager ();
	r.Job = Job;
	r.Row = Row;
	r.Started = CurrentSessionDate ();
	r.Write ();
	
EndProcedure

Procedure FinishScenario ( val Job, val Row ) export
	
	SetPrivilegedMode ( true );
	r = InformationRegisters.AgentScenarios.CreateRecordManager ();
	r.Job = Job;
	r.Row = Row;
	r.Read ();
	r.Finished = CurrentSessionDate ();
	r.Write ();
	
EndProcedure

Procedure Create ( Job, Agent, Date, Computer ) export
	
	SetPrivilegedMode ( true );
	r = InformationRegisters.AgentJobs.CreateRecordManager ();
	r.Job = Job;
	r.Status = Enums.JobStatuses.Pending;
	r.Write ();
	r = InformationRegisters.Jobs.CreateRecordManager ();
	r.Job = Job;
	r.Agent = Agent;
	r.Created = Date;
	r.Computer = Computer;
	r.Write ();
	
EndProcedure

Procedure Testing ( Job ) export
	
	BeginTransaction ();
	lockJob ( Job );
	skip = not DF.Pick ( Job, "IgnoreCompletion" )
	and jobActive ( Job );
	if ( skip ) then
		RollbackTransaction ();
		return;
	endif;
	obj = Job.GetObject ().Copy ();
	obj.Date = CurrentSessionDate ();
	obj.Mode = Enums.Running.Now;
	obj.Job = Job;
	obj.Memo = "";
	obj.Write ();
	TesterAgent.Create ( obj.Ref, obj.Agent, obj.Date, obj.Computer );
	CommitTransaction ();
	
EndProcedure

Procedure lockJob ( Job )
	
	lock = new DataLock ();
	item = lock.Add ( "Document.Job" );
	item.Mode = DataLockMode.Exclusive;
	item.SetValue ( "Ref", Job );
	lock.Lock ();
	
EndProcedure

Function jobActive ( Job )
	
	s = "
	|select top 1 1
	|from Document.Job as Jobs
	|	//
	|	// AgentJobs
	|	//
	|	join InformationRegister.AgentJobs as AgentJobs
	|	on AgentJobs.Job = Jobs.Ref
	|	and AgentJobs.Status in ( value ( Enum.JobStatuses.Pending ), value ( Enum.JobStatuses.Running ) )
	|where Jobs.Job = &Job
	|and not Jobs.DeletionMark
	|order by Jobs.Date desc
	|";
	q = new Query ( s );
	q.SetParameter ( "Job", Job );
	return not q.Execute ().IsEmpty ();
	
EndFunction

Function Canceled ( val Job ) export
	
	s = "
	|select top 1 1
	|from InformationRegister.AgentJobs as AgentJobs
	|where AgentJobs.Job = &Job
	|and AgentJobs.Status = value ( Enum.JobStatuses.Removed )
	|";
	q = new Query ( s );
	q.SetParameter ( "Job", Job );
	return not q.Execute ().IsEmpty ();
	
EndFunction

Procedure CreateJob ( val Agent, val Scenario, val Application, val Parameters, val Computer, val Memo ) export
	
	obj = Documents.Job.CreateDocument ();
	obj.Date = CurrentSessionDate ();
	obj.Agent = findAgent ( Agent );
	if ( Computer <> undefined ) then
		obj.Computer = findComputer ( Computer );
	endif;
	obj.Creator = SessionParameters.User;
	obj.Parameters = Conversion.ToJSON ( Parameters, false );
	obj.Memo = Memo;
	obj.Mode = Enums.Running.Now;
	row = obj.Scenarios.Add ();
	row.Scenario = findScenario ( Scenario, Application );
	row.Application = EnvironmentSrv.FindApplication ( Application );
	obj.Write ();
	
EndProcedure

Function findAgent ( Agent )
	
	ref = Catalogs.Users.FindByDescription ( Agent );
	if ( ref.IsEmpty () ) then
		raise Output.AgentNotFound ( new Structure ( "Agent", Agent ) );
	endif;
	return ref;
	
EndFunction

Function findComputer ( Computer )
	
	ref = Catalogs.Computers.FindByDescription ( Computer );
	if ( ref.IsEmpty () ) then
		raise Output.ComputerNotFound ( new Structure ( "Computer", Computer ) );
	endif;
	return ref;
	
EndFunction

Function findScenario ( Scenario, Application )
	
	ref = RuntimeSrv.FindScenario ( Scenario, undefined, Application, undefined, true );
	if ( ref = undefined ) then
		raise Output.ScenarioNotFound ( new Structure ( "Name", Scenario ) );
	endif;
	return ref;
	
EndFunction
